NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series1/EFM32GG11B/EFM32GG11B840F1024IL152.svd
        <register>
          <name>HFBUSCLKEN0</name>
          <description>High Frequency Bus Clock Enable Register 0</description>
          <addressOffset>0x0B0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000007FF</resetMask>
          <fields>
            <field>
              <name>LE</name>
              <description>Low Energy Peripheral Interface Clock Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CRYPTO0</name>
              <description>Advanced Encryption Standard Accelerator Clock Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EBI</name>
              <description>External Bus Interface Clock Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETH</name>
              <description>Ethernet Controller Clock Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SDIO</name>
              <description>SDIO Controller Clock Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO</name>
              <description>General purpose Input/Output Clock Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRS</name>
              <description>Peripheral Reflex System Clock Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LDMA</name>
              <description>Linked Direct Memory Access Controller Clock Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPCRC</name>
              <description>General Purpose CRC Clock Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>QSPI0</name>
              <description>Quad-SPI Clock Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB</name>
              <description>Universal Serial Bus Interface Clock Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HFPERCLKEN0</name>
          <description>High Frequency Peripheral Clock Enable Register 0</description>
          <addressOffset>0x0C0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x01FFFFFF</resetMask>
          <fields>
            <field>
              <name>TIMER0</name>
              <description>Timer 0 Clock Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER1</name>
              <description>Timer 1 Clock Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER2</name>
              <description>Timer 2 Clock Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER3</name>
              <description>Timer 3 Clock Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER4</name>
              <description>Timer 4 Clock Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER5</name>
              <description>Timer 5 Clock Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER6</name>
              <description>Timer 6 Clock Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USART0</name>
              <description>Universal Synchronous/Asynchronous Receiver/Transmitter 0 Clock Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USART1</name>
              <description>Universal Synchronous/Asynchronous Receiver/Transmitter 1 Clock Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USART2</name>
              <description>Universal Synchronous/Asynchronous Receiver/Transmitter 2 Clock Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USART3</name>
              <description>Universal Synchronous/Asynchronous Receiver/Transmitter 3 Clock Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USART4</name>
              <description>Universal Synchronous/Asynchronous Receiver/Transmitter 4 Clock Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USART5</name>
              <description>Universal Synchronous/Asynchronous Receiver/Transmitter 5 Clock Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ACMP0</name>
              <description>Analog Comparator 0 Clock Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ACMP1</name>
              <description>Analog Comparator 1 Clock Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ACMP2</name>
              <description>Analog Comparator 1 Clock Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ACMP3</name>
              <description>Analog Comparator 3 Clock Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C0</name>
              <description>I2C 0 Clock Enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C1</name>
              <description>I2C 1 Clock Enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C2</name>
              <description>I2C 2 Clock Enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC0</name>
              <description>Analog to Digital Converter 0 Clock Enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC1</name>
              <description>Analog to Digital Converter 0 Clock Enable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CRYOTIMER</name>
              <description>CRYOTIMER Clock Enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IDAC0</name>
              <description>Current Digital to Analog Converter 0 Clock Enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRNG0</name>
              <description>True Random Number Generator 0 Clock Enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HFPERCLKEN1</name>
          <description>High Frequency Peripheral Clock Enable Register 1</description>
          <addressOffset>0x0C4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000003FF</resetMask>
          <fields>
            <field>
              <name>WTIMER0</name>
              <description>Wide Timer 0 Clock Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WTIMER1</name>
              <description>Wide Timer 0 Clock Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WTIMER2</name>
              <description>Wide Timer 2 Clock Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WTIMER3</name>
              <description>Wide Timer 3 Clock Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UART0</name>
              <description>Universal Asynchronous Receiver/Transmitter 0 Clock Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UART1</name>
              <description>Universal Asynchronous Receiver/Transmitter 1 Clock Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN0</name>
              <description>CAN 0 Clock Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN1</name>
              <description>CAN 1 Clock Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VDAC0</name>
              <description>Digital to Analog Converter 0 Clock Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSEN</name>
              <description>Capacitive touch sense module Clock Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LFACLKEN0</name>
          <description>Low Frequency a Clock Enable Register 0 (Async Reg)</description>
          <addressOffset>0x0E0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000001F</resetMask>
          <fields>
            <field>
              <name>LETIMER0</name>
              <description>Low Energy Timer 0 Clock Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LETIMER1</name>
              <description>Low Energy Timer 1 Clock Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LESENSE</name>
              <description>Low Energy Sensor Interface Clock Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCD</name>
              <description>Liquid Crystal Display Controller Clock Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTC</name>
              <description>Real-Time Counter Clock Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LFBCLKEN0</name>
          <description>Low Frequency B Clock Enable Register 0 (Async Reg)</description>
          <addressOffset>0x0E8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>
          <fields>
            <field>
              <name>LEUART0</name>
              <description>Low Energy UART 0 Clock Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEUART1</name>
              <description>Low Energy UART 1 Clock Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSTICK</name>
              <description> Clock Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSEN</name>
              <description>Capacitive touch sense module Clock Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LFCCLKEN0</name>
          <description>Low Frequency C Clock Enable Register 0 (Async Reg)</description>
          <addressOffset>0x0EC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>USB</name>
              <description>Universal Serial Bus Interface Clock Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LFECLKEN0</name>
          <description>Low Frequency E Clock Enable Register 0 (Async Reg)</description>
          <addressOffset>0x0F0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>RTCC</name>
              <description>Real-Time Counter and Calendar Clock Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HFPRESC</name>
          <description>High Frequency Clock Prescaler Register</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x03001F00</resetMask>
          <fields>
            <field>
              <name>PRESC</name>
              <description>HFCLK Prescaler</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NODIVISION</name>
                  <value>0x00000000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HFCLKLEPRESC</name>
              <description>HFCLKLE Prescaler</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV2</name>
                  <description>HFCLKLE is HFBUSCLKLE divided by 2.</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV4</name>
                  <description>HFCLKLE is HFBUSCLKLE divided by 4.</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV8</name>
                  <description>HFCLKLE is HFBUSCLKLE divided by 8.</description>
                  <value>0x00000002</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HFBUSPRESC</name>
          <description>High Frequency Bus Clock Prescaler Register</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0001FF00</resetMask>
          <fields>
            <field>
              <name>PRESC</name>
              <description>HFBUSCLK Prescaler</description>
              <bitOffset>8</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NODIVISION</name>
                  <value>0x00000000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HFCOREPRESC</name>
          <description>High Frequency Core Clock Prescaler Register</description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0001FF00</resetMask>
          <fields>
            <field>
              <name>PRESC</name>
              <description>HFCORECLK Prescaler</description>
              <bitOffset>8</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NODIVISION</name>
                  <value>0x00000000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HFPERPRESC</name>
          <description>High Frequency Peripheral Clock Prescaler Register</description>
          <addressOffset>0x10C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0001FF00</resetMask>
          <fields>
            <field>
              <name>PRESC</name>
              <description>HFPERCLK Prescaler</description>
              <bitOffset>8</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NODIVISION</name>
                  <value>0x00000000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HFEXPPRESC</name>
          <description>High Frequency Export Clock Prescaler Register</description>
          <addressOffset>0x114</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00001F00</resetMask>
          <fields>
            <field>
              <name>PRESC</name>
              <description>HFEXPCLK Prescaler</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NODIVISION</name>
                  <value>0x00000000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
