NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series1/EFM32GG11B/EFM32GG11B840F1024IL152.svd
        <register>
          <name>EXTIFCTRL</name>
          <description>External Override Interface Control</description>
          <addressOffset>0x048</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000F1</resetMask>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable External Interface</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>APORTSEL</name>
              <description>APORT Selection for External Interface</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>APORT0X</name>
                  <description>APORT0X used. EXT_BASE = ACMP_INPUTSEL_POSSEL_APORT0XCH0.</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT0Y</name>
                  <description>APORT0Y used. EXT_BASE = ACMP_INPUTSEL_POSSEL_APORT0YCH0.</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1X</name>
                  <description>APORT1X used. EXT_BASE = ACMP_INPUTSEL_POSSEL_APORT1XCH0.</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1Y</name>
                  <description>APORT1Y used. EXT_BASE = ACMP_INPUTSEL_POSSEL_APORT1XCH0.</description>
                  <value>0x00000003</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1XY</name>
                  <description>APORT1X/Y used. EXT_BASE = ACMP_INPUTSEL_POSSEL_APORT1XCH0.</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT2X</name>
                  <description>APORT2X used. EXT_BASE = ACMP_INPUTSEL_POSSEL_APORT2YCH0.</description>
                  <value>0x00000005</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT2Y</name>
                  <description>APORT2Y used. EXT_BASE = ACMP_INPUTSEL_POSSEL_APORT2YCH0.</description>
                  <value>0x00000006</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT2YX</name>
                  <description>APORT2Y/X used. EXT_BASE = ACMP_INPUTSEL_POSSEL_APORT2YCH0.</description>
                  <value>0x00000007</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT3X</name>
                  <description>APORT3X used. EXT_BASE = ACMP_INPUTSEL_POSSEL_APORT3XCH0.</description>
                  <value>0x00000008</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT3Y</name>
                  <description>APORT3Y used. EXT_BASE = ACMP_INPUTSEL_POSSEL_APORT3XCH0.</description>
                  <value>0x00000009</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT3XY</name>
                  <description>APORT3X/Y used. EXT_BASE = ACMP_INPUTSEL_POSSEL_APORT3XCH0.</description>
                  <value>0x0000000A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT4X</name>
                  <description>APORT4X used. EXT_BASE = ACMP_INPUTSEL_POSSEL_APORT4YCH0.</description>
                  <value>0x0000000B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT4Y</name>
                  <description>APORT4Y used. EXT_BASE = ACMP_INPUTSEL_POSSEL_APORT4YCH0.</description>
                  <value>0x0000000C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT4YX</name>
                  <description>APORT4Y/X used. EXT_BASE = ACMP_INPUTSEL_POSSEL_APORT4YCH0.</description>
                  <value>0x0000000D</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>VDAC0</name>
      <description>VDAC0</description>
      <baseAddress>0x40086000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00000400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>VDAC0</name>
        <value>46</value>
      </interrupt>
      <registers>
        <register>
          <name>CTRL</name>
          <description>Control Register</description>
          <addressOffset>0x000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x937F0771</resetMask>
          <fields>
            <field>
              <name>DIFF</name>
              <description>Differential Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SINEMODE</name>
              <description>Sine Mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTENPRS</name>
              <description>PRS Controlled Output Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0PRESCRST</name>
              <description>Channel 0 Start Reset Prescaler</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REFSEL</name>
              <description>Reference Selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1V25LN</name>
                  <description>Internal low noise 1.25 V bandgap reference</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2V5LN</name>
                  <description>Internal low noise 2.5 V bandgap reference</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1V25</name>
                  <description>Internal 1.25 V bandgap reference</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2V5</name>
                  <description>Internal 2.5 V bandgap reference</description>
                  <value>0x00000003</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDD</name>
                  <description>AVDD reference</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXT</name>
                  <description>External pin reference</description>
                  <value>0x00000006</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRESC</name>
              <description>Prescaler Setting for DAC Clock</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NODIVISION</name>
                  <value>0x00000000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REFRESHPERIOD</name>
              <description>Refresh Period</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>8CYCLES</name>
                  <description>All channels with enabled refresh are refreshed every 8 DAC_CLK cycles</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16CYCLES</name>
                  <description>All channels with enabled refresh are refreshed every 16 DAC_CLK cycles</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32CYCLES</name>
                  <description>All channels with enabled refresh are refreshed every 32 DAC_CLK cycles</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64CYCLES</name>
                  <description>All channels with enabled refresh are refreshed every 64 DAC_CLK cycles</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WARMUPMODE</name>
              <description>Warm-up Mode</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DACCLKMODE</name>
              <description>Clock Mode</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>Status Register</description>
          <addressOffset>0x004</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0000000C</resetValue>
          <resetMask>0xFFFF003F</resetMask>
          <fields>
            <field>
              <name>CH0ENS</name>
              <description>Channel 0 Enabled Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH1ENS</name>
              <description>Channel 1 Enabled Status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH0BL</name>
              <description>Channel 0 Buffer Level</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH1BL</name>
              <description>Channel 1 Buffer Level</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH0WARM</name>
              <description>Channel 0 Warm</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH1WARM</name>
              <description>Channel 1 Warm</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OPA0APORTCONFLICT</name>
              <description>OPA0 Bus Conflict Output</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OPA1APORTCONFLICT</name>
              <description>OPA1 Bus Conflict Output</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OPA2APORTCONFLICT</name>
              <description>OPA2 Bus Conflict Output</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OPA3APORTCONFLICT</name>
              <description>OPA3 Bus Conflict Output</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OPA0ENS</name>
              <description>OPA0 Enabled Status</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OPA1ENS</name>
              <description>OPA1 Enabled Status</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OPA2ENS</name>
              <description>OPA2 Enabled Status</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OPA3ENS</name>
              <description>OPA3 Enabled Status</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OPA0WARM</name>
              <description>OPA0 Warm Status</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OPA1WARM</name>
              <description>OPA1 Warm Status</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OPA2WARM</name>
              <description>OPA2 Warm Status</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OPA3WARM</name>
              <description>OPA3 Warm Status</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OPA0OUTVALID</name>
              <description>OPA0 Output Valid Status</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OPA1OUTVALID</name>
              <description>OPA1 Output Valid Status</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OPA2OUTVALID</name>
              <description>OPA2 Output Valid Status</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OPA3OUTVALID</name>
              <description>OPA3 Output Valid Status</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
